load-tests/endpoints/get-profile-admin.yml
config:
  target: "https://job-portal-bwc9haethua7h0gw.malaysiawest-01.azurewebsites.net"
  phases:
    - duration: 20
      arrivalRate: 10
scenarios:
  - name: get-profile
    flow:
      - get:
          url: "api/v1/admin/users"
          headers:
            Authorization: "Bearer {{ token }}"
          expect:
            - statusCode: 200